# Pandas Library
Pandas is a Python library, used to analyze data.It offers data structures and operations for manipulating numerical tables and time series.
1. Series
2. DataFrame

# Series 
Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index. Pandas Series is nothing but a column in an excel sheet.
Labels need not be unique but must be a hashable type.

In [1]:
import pandas as pd
l=[10,20,30,40]
pd.Series(l)

0    10
1    20
2    30
3    40
dtype: int64

In [2]:
pd.Series([10,20,30])

0    10
1    20
2    30
dtype: int64

In [3]:
#If we want some specific index

pd.Series([10,20,30], index=['i','ii','iii'])

i      10
ii     20
iii    30
dtype: int64

In [4]:
s=pd.Series()
print(s)

Series([], dtype: float64)

<ipython-input-4-f8daae661c20>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s=pd.Series()

In [5]:
import numpy as np
a=np.array([10.4,20.5,30.6,21,0])
print(a)

[10.4 20.5 30.6 21.   0. ]

In [6]:
s=pd.Series(a)
print(s)

0    10.4
1    20.5
2    30.6
3    21.0
4     0.0
dtype: float64

In [7]:
d={'a':25,'b':45,'c':67}
s=pd.Series(d)
print(s)

a    25
b    45
c    67
dtype: int64

In [8]:
#Return series as array elements

s.array

<PandasArray>
[25, 45, 67]
Length: 3, dtype: int64

In [9]:
#Gives the index of series

s.index

Index(['a', 'b', 'c'], dtype='object')

In [10]:
#Gives the values of series

s.values

array([25, 45, 67], dtype=int64)

In [11]:
f=pd.Series([10,20,30],index=['i','ii','iii'],name='exam')

In [12]:
f.name

'exam'

In [13]:
f.shape

(3,)

In [14]:
f.size

3

In [15]:
f.ndim

1

In [16]:
f.nbytes

24

In [17]:
f.memory_usage()

48

In [18]:
f.empty

False

##### Mathematical Operations on Series

In [19]:
s1=pd.Series([10,20,30])
s2=pd.Series([20,100,200])

In [20]:
print(s1+s2)

0     30
1    120
2    230
dtype: int64

In [21]:
s1.add(s2)

0     30
1    120
2    230
dtype: int64

In [22]:
print(s1-s2)

0    -10
1    -80
2   -170
dtype: int64

In [23]:
s1.subtract(s2)

0    -10
1    -80
2   -170
dtype: int64

In [24]:
print(s1*s2)

0     200
1    2000
2    6000
dtype: int64

In [25]:
s1.multiply(s2)

0     200
1    2000
2    6000
dtype: int64

In [26]:
print(s1/s2)

0    0.50
1    0.20
2    0.15
dtype: float64

In [27]:
s1.divide(s2)

0    0.50
1    0.20
2    0.15
dtype: float64

In [28]:
s1%s2

0    10
1    20
2    30
dtype: int64

In [29]:
s1.mod(s2)

0    10
1    20
2    30
dtype: int64

In [30]:
print(s1**s2)

0    7766279631452241920
1                      0
2                      0
dtype: int64

In [31]:
#If s1 is less than s2, the operation return true, otherwise false

s1.le(s2)

0    True
1    True
2    True
dtype: bool

In [32]:
s1.pow(s2)

0    7766279631452241920
1                      0
2                      0
dtype: int64

In [33]:
#Used to compare two series and return Boolean value for every respective element

s1.gt(s2)

0    False
1    False
2    False
dtype: bool

In [34]:
print(s1==s2)

0    False
1    False
2    False
dtype: bool

In [35]:
#Used to compare every element of Caller series with passed series. 
#It returns True for every element which is Equal to the element in passed series

s1.eq(s2)

0    False
1    False
2    False
dtype: bool

In [36]:
#All elements should be equal

s1.equals(s2)

False

# DataFrames
Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

In [37]:
#Load data from excel file

d=pd.read_excel("C:\\Users\\prabh\\OneDrive\\Desktop\\Sample2.xls")

In [38]:
df=pd.DataFrame(d)
print(df)

   ID      NAME BRANCH  AGE
0   1   Sandhya    CSE   22
1   2  Narayana    ECE   21
2   3    Venkat    CSE   20
3   4     Durga    EEE   18
4   5   Saranya  CIVIL   19
5   6      Bala    CSE   22

In [39]:
d=pd.read_csv("C:\\Users\\prabh\\OneDrive\\Desktop\\Sample3.csv")

In [40]:
df1=pd.DataFrame(d)
print(df1)

   ID      NAME BRANCH  AGE
0   1   Sandhya    CSE   22
1   2  Narayana    ECE   21
2   3    Venkat    CSE   20
3   4     Durga    EEE   18
4   5   Saranya  CIVIL   19
5   6      Bala    CSE   22

##### Create DataFrame using Dictionaries

In [41]:
d={'Name':['Sandhya','Venkat','Bala'], 'Branch':['CSE', 'IT', 'ECE']}
df=pd.DataFrame(d)
print(df)

      Name Branch
0  Sandhya    CSE
1   Venkat     IT
2     Bala    ECE

In [42]:
d=pd.read_excel("C:\\Users\\prabh\\OneDrive\\Desktop\\Sample2.xls")
df=pd.DataFrame(d)
print(df)

   ID      NAME BRANCH  AGE
0   1   Sandhya    CSE   22
1   2  Narayana    ECE   21
2   3    Venkat    CSE   20
3   4     Durga    EEE   18
4   5   Saranya  CIVIL   19
5   6      Bala    CSE   22

In [43]:
df.head()

   ID      NAME BRANCH  AGE
0   1   Sandhya    CSE   22
1   2  Narayana    ECE   21
2   3    Venkat    CSE   20
3   4     Durga    EEE   18
4   5   Saranya  CIVIL   19

In [44]:
df.head(3)

   ID      NAME BRANCH  AGE
0   1   Sandhya    CSE   22
1   2  Narayana    ECE   21
2   3    Venkat    CSE   20

In [45]:
df.tail()

   ID      NAME BRANCH  AGE
1   2  Narayana    ECE   21
2   3    Venkat    CSE   20
3   4     Durga    EEE   18
4   5   Saranya  CIVIL   19
5   6      Bala    CSE   22

In [46]:
df.tail(2)

   ID     NAME BRANCH  AGE
4   5  Saranya  CIVIL   19
5   6     Bala    CSE   22

In [47]:
df.describe()

             ID        AGE
count  6.000000   6.000000
mean   3.500000  20.333333
std    1.870829   1.632993
min    1.000000  18.000000
25%    2.250000  19.250000
50%    3.500000  20.500000
75%    4.750000  21.750000
max    6.000000  22.000000

In [48]:
df.shape

(6, 4)

In [49]:
df.size

24

In [50]:
print(df)

   ID      NAME BRANCH  AGE
0   1   Sandhya    CSE   22
1   2  Narayana    ECE   21
2   3    Venkat    CSE   20
3   4     Durga    EEE   18
4   5   Saranya  CIVIL   19
5   6      Bala    CSE   22

In [51]:
df['NAME']

0     Sandhya
1    Narayana
2      Venkat
3       Durga
4     Saranya
5        Bala
Name: NAME, dtype: object

In [52]:
df[['ID','AGE']]

   ID  AGE
0   1   22
1   2   21
2   3   20
3   4   18
4   5   19
5   6   22

In [53]:
df[['ID','AGE']][0:4]

   ID  AGE
0   1   22
1   2   21
2   3   20
3   4   18

In [54]:
df[['ID','AGE']][0:]

   ID  AGE
0   1   22
1   2   21
2   3   20
3   4   18
4   5   19
5   6   22

In [55]:
df[['ID','AGE']][0:6:3]

   ID  AGE
0   1   22
3   4   18

In [56]:
df[['ID','AGE']][0:-2]

   ID  AGE
0   1   22
1   2   21
2   3   20
3   4   18

In [57]:
df[['ID','AGE']][0:5:4]

   ID  AGE
0   1   22
4   5   19

In [58]:
df[['ID','AGE','BRANCH']][0:5:4]

   ID  AGE BRANCH
0   1   22    CSE
4   5   19  CIVIL

In [59]:
#Location function - takes index as parameter

df.loc[2]

ID             3
NAME      Venkat
BRANCH       CSE
AGE           20
Name: 2, dtype: object

In [60]:
df.loc[df['ID']==2]

   ID      NAME BRANCH  AGE
1   2  Narayana    ECE   21

In [61]:
df.loc[df['BRANCH']=='CSE']

   ID     NAME BRANCH  AGE
0   1  Sandhya    CSE   22
2   3   Venkat    CSE   20
5   6     Bala    CSE   22

In [62]:
df.loc[(df['BRANCH']=='CSE') | (df['BRANCH']=='ECE')]

   ID      NAME BRANCH  AGE
0   1   Sandhya    CSE   22
1   2  Narayana    ECE   21
2   3    Venkat    CSE   20
5   6      Bala    CSE   22

In [63]:
df.loc[(df['BRANCH']=='CSE') | (df['AGE']>22)]

   ID     NAME BRANCH  AGE
0   1  Sandhya    CSE   22
2   3   Venkat    CSE   20
5   6     Bala    CSE   22